erikbeerepoot/RobotSoftware/RobotController.ioc
#MicroXplorer Configuration settings - do not modify
#Tue Jun 10 20:34:23 EDT 2014
File.Version=3
KeepUserPlacement=false
Mcu.Family=STM32F4
Mcu.IP0=NVIC
Mcu.IP1=RCC
Mcu.IP2=RTC
Mcu.IP3=SPI2
Mcu.IP4=SPI4
Mcu.IP5=USART1
Mcu.IPNb=6
Mcu.Name=STM32F439V(G-I)Tx
Mcu.Package=LQFP100
Mcu.Pin0=PE2
Mcu.Pin1=PE4
Mcu.Pin10=PA12
Mcu.Pin11=VP_RTC_VS_RTC_WakeUp_intern
Mcu.Pin2=PE6
Mcu.Pin3=PC2
Mcu.Pin4=PC3
Mcu.Pin5=PB10
Mcu.Pin6=PB12
Mcu.Pin7=PA9
Mcu.Pin8=PA10
Mcu.Pin9=PA11
Mcu.PinsNb=12
Mcu.UserName=STM32F439VITx
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_0
NVIC.SysTick_IRQn=true\:0\:0
PA10.Mode=Asynchronous
PA10.Signal=USART1_RX
PA11.Mode=CTS_RTS
PA11.Signal=USART1_CTS
PA12.Mode=CTS_RTS
PA12.Signal=USART1_RTS
PA9.Mode=Asynchronous
PA9.Signal=USART1_TX
PB10.Mode=Full_Duplex_Master
PB10.Signal=SPI2_SCK
PB12.Mode=NSS_Signal_Hard
PB12.Signal=SPI2_NSS
PC2.Mode=Full_Duplex_Master
PC2.Signal=SPI2_MISO
PC3.Mode=Full_Duplex_Master
PC3.Signal=SPI2_MOSI
PCC.Battery=Not set
PCC.Battery.Capacity=0.0
PCC.Battery.Compatibility=NoBatterySelected
PCC.Battery.InParallel=1
PCC.Battery.InSeries=1
PCC.Battery.MaxContinuous=0.0
PCC.Battery.MaxPulseCurrent=0.0
PCC.Battery.NominalVoltage=0.0
PCC.Battery.SelfDischarge=0.0
PCC.Family=STM32F4
PCC.MCU=STM32F439V(G-I)Tx
PCC.MXVersion=4.2.0
PCC.PartNumber=STM32F439VITx
PCC.Seq0=0
PCC.SubFamily=STM32F429/439
PCC.Temperature=25
PCC.Vdd=3.3
PE2.Mode=Simplex_Bidirectional_Master
PE2.Signal=SPI4_SCK
PE4.Mode=NSS_Signal_Hard
PE4.Signal=SPI4_NSS
PE6.Mode=Simplex_Bidirectional_Master
PE6.Signal=SPI4_MOSI
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=2
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F439VITx
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.1.0
ProjectManager.FreePins=false
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=0
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=hello.ioc
ProjectManager.ProjectName=hello
ProjectManager.TargetToolchain=MDK-ARM 4.73
RCC.FamilyName=M
RCC.HSE_VALUE=25000000
RCC.HSI_VALUE=16000000
RCC.IPParameters=AHBFreq_Value,RTCHSEDivFreq_Value,APB2Freq_Value,VCOInputFreq_Value,48MHZClocksFreq_Value,SYSCLKFreq_VALUE,VCOSAIOutputFreq_Value,VCOI2SOutputFreq_Value,RTCFreq_Value,I2SClocksFreq_Value,LSI_VALUE,APB1Freq_Value,HSI_VALUE,HSE_VALUE,PLLCLKFreq_Value,LSE_VALUE,FamilyName,VCOOutputFreq_Value
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
SPI2.CalculateBaudRate-Full_Duplex_Master=8.0 MBits/s
SPI2.IPParameters=CalculateBaudRate-Full_Duplex_Master,Mode-Full_Duplex_Master,VirtualNSS
SPI2.Mode-Full_Duplex_Master=SPI_MODE_MASTER
SPI2.VirtualNSS=VM_NSSHARD
SPI4.CalculateBaudRate-Simplex_Bidirectional_Master=8.0 MBits/s
SPI4.Direction-Simplex_Bidirectional_Master=SPI_DIRECTION_1LINE
SPI4.IPParameters=CalculateBaudRate-Simplex_Bidirectional_Master,Direction-Simplex_Bidirectional_Master,Mode-Simplex_Bidirectional_Master,VirtualNSS
SPI4.Mode-Simplex_Bidirectional_Master=SPI_MODE_MASTER
SPI4.VirtualNSS=VM_NSSHARD
VP_RTC_VS_RTC_WakeUp_intern.Mode=WakeUp
VP_RTC_VS_RTC_WakeUp_intern.Signal=RTC_VS_RTC_WakeUp_intern
